#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/lisuk-dev/plates/runs/run-9oqbPwDdykyFHbBa

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
aws_dynamodb_table.tf_notes_table: Refreshing state... [id=tf-notes-table]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_dynamodb_table.tf_notes_table will be destroyed
  # (because aws_dynamodb_table.tf_notes_table is not in configuration)
  - resource "aws_dynamodb_table" "tf_notes_table" {
      - arn                         = "arn:aws:dynamodb:us-east-2:631500494754:table/tf-notes-table" -> null
      - billing_mode                = "PAY_PER_REQUEST" -> null
      - deletion_protection_enabled = false -> null
      - hash_key                    = "noteId" -> null
      - id                          = "tf-notes-table" -> null
      - name                        = "tf-notes-table" -> null
      - read_capacity               = 0 -> null
      - stream_enabled              = false -> null
      - table_class                 = "STANDARD" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - write_capacity              = 0 -> null

      - attribute {
          - name = "noteId" -> null
          - type = "S" -> null
        }

      - point_in_time_recovery {
          - enabled = false -> null
        }

      - ttl {
          - enabled = false -> null
        }
    }

  # aws_dynamodb_table.user_workout_templates will be created
  + resource "aws_dynamodb_table" "user_workout_templates" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "userId"
      + id               = (known after apply)
      + name             = "UserWorkoutTemplates"
      + range_key        = "templateId"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "templateId"
          + type = "S"
        }
      + attribute {
          + name = "userId"
          + type = "S"
        }
    }

  # aws_dynamodb_table.workout_templates will be created
  + resource "aws_dynamodb_table" "workout_templates" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "WorkoutTemplates"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.


```
</details>
*Pushed by: @lisukdev, Action: `pull_request`*